Debug compare API
